In [2]:
from bs4 import BeautifulSoup
import requests
import pandas as pd
import re

In [3]:
url = 'https://ec.europa.eu/eurostat/statistics-explained/index.php/Glossary:Country_codes'
html = requests.get(url).content

soup = BeautifulSoup(html, 'html.parser')

In [4]:
tables_df = pd.read_html(url)

In [5]:
table1_df = tables_df[0]
table2_df = tables_df[1]
table3_df = tables_df[2]
table4_df = tables_df[3]
table5_df = tables_df[4]
table6_df = tables_df[5]
table7_df = tables_df[6]
table8_df = tables_df[7]
table9_df = tables_df[8]

In [6]:
table2_df = table2_df.drop(columns=[2])

In [7]:
table3_df = table3_df.drop(columns=[2])

In [8]:
table6_df = table6_df.drop(columns=[2,5])

In [9]:
table7_df = table7_df.drop(columns=[2,5])

In [10]:
table9_df = table9_df.drop(columns=[2,5,8])

In [11]:
columns = ['Country', 'CountryCode']

In [12]:
table1_1 = table1_df[[0,1]]
table1_1.columns = columns
table1_2 = table1_df[[2,3]]
table1_2.columns = columns
table1_3 = table1_df[[4,5]]
table1_3.columns = columns
table1_4 = table1_df[[6,7]]
table1_4.columns = columns

In [13]:
table1 = pd.concat([table1_1, table1_2, table1_3, table1_4],axis=0)
table1.reset_index(drop=True, inplace=True)

In [14]:
table2_1 = table2_df[[0,1]]
table2_1.columns = columns
table2_2 = table2_df[[3,4]]
table2_2.columns = columns
table2 = pd.concat([table2_1, table2_2],axis=0)
table2.reset_index(drop=True, inplace=True)
table2

         Country CountryCode
0        Iceland        (IS)
1  Liechtenstein        (LI)
2         Norway        (NO)
3    Switzerland        (CH)

In [15]:
table3_df.columns = columns
table3_df

          Country CountryCode
0  United Kingdom        (UK)

In [16]:
table4_df.columns = columns
table4_df

           Country CountryCode
0       Montenegro        (ME)
1  North Macedonia        (MK)
2          Albania        (AL)
3           Serbia        (RS)
4           Turkey        (TR)

In [17]:
table5_df.columns = columns
table5_df

                  Country CountryCode
0  Bosnia and Herzegovina        (BA)
1                 Kosovo*     (XK[1])

In [18]:
table6_df

            0     1        3     4        6     7
0     Armenia  (AM)  Belarus  (BY)  Georgia  (GE)
1  Azerbaijan  (AZ)  Moldova  (MD)  Ukraine  (UA)

In [19]:
table6_1 = table6_df[[0,1]]
table6_1.columns = columns
table6_2 = table6_df[[3,4]]
table6_2.columns = columns
table6_3 = table6_df[[6,7]]
table6_3.columns = columns
table6 = pd.concat([table6_1, table6_2, table6_3],axis=0)
table6.reset_index(drop=True, inplace=True)
table6

      Country CountryCode
0     Armenia        (AM)
1  Azerbaijan        (AZ)
2     Belarus        (BY)
3     Moldova        (MD)
4     Georgia        (GE)
5     Ukraine        (UA)

In [20]:
table7_1 = table7_df[[0,1]]
table7_1.columns = columns
table7_2 = table7_df[[3,4]]
table7_2.columns = columns
table7_3 = table7_df[[6,7]]
table7_3.columns = columns
table7 = pd.concat([table7_1, table7_2, table7_3],axis=0)
table7.reset_index(drop=True, inplace=True)
table7

          Country CountryCode
0         Algeria        (DZ)
1           Egypt        (EG)
2          Israel        (IL)
3          Jordan        (JO)
4         Lebanon        (LB)
5           Libya        (LY)
6         Morocco        (MA)
7   Palestine [2]        (PS)
8           Syria        (SY)
9         Tunisia        (TN)
10            NaN         NaN
11            NaN         NaN

In [21]:
table8_df.columns = columns
table8_df

  Country CountryCode
0  Russia        (RU)

In [22]:
table9_1 = table9_df[[0,1]]
table9_1.columns = columns
table9_2 = table9_df[[3,4]]
table9_2.columns = columns
table9_3 = table9_df[[6,7]]
table9_3.columns = columns
table9_4 = table9_df[[9,10]]
table9_4.columns = columns
table9 = pd.concat([table9_1, table9_2, table9_3, table9_4],axis=0)
table9.reset_index(drop=True, inplace=True)
table9

                     Country CountryCode
0                  Argentina        (AR)
1                  Australia        (AU)
2                     Brazil        (BR)
3                     Canada        (CA)
4   China (except Hong Kong)   (CN_X_HK)
5                  Hong Kong        (HK)
6                      India        (IN)
7                      Japan        (JP)
8                     Mexico        (MX)
9                    Nigeria        (NG)
10               New Zealand        (NZ)
11                 Singapore        (SG)
12              South Africa        (ZA)
13               South Korea        (KR)
14                    Taiwan        (TW)
15             United States        (US)

In [57]:
table = pd.concat([table1, table2, table3_df, table4_df, table5_df, table6, table7, table8_df, table9],axis=0)

In [58]:
table.reset_index(drop=True, inplace=True)
table['CountryCode'].unique()

array(['(BE)', '(BG)', '(CZ)', '(DK)', '(DE)', '(EE)', '(IE)', '(EL)',
       '(ES)', '(FR)', '(HR)', '(IT)', '(CY)', '(LV)', '(LT)', '(LU)',
       '(HU)', '(MT)', '(NL)', '(AT)', '(PL)', '(PT)', '(RO)', '(SI)',
       '(SK)', '(FI)', '(SE)', nan, '(IS)', '(LI)', '(NO)', '(CH)',
       '(UK)', '(ME)', '(MK)', '(AL)', '(RS)', '(TR)', '(BA)', '(XK[1])',
       '(AM)', '(AZ)', '(BY)', '(MD)', '(GE)', '(UA)', '(DZ)', '(EG)',
       '(IL)', '(JO)', '(LB)', '(LY)', '(MA)', '(PS)', '(SY)', '(TN)',
       '(RU)', '(AR)', '(AU)', '(BR)', '(CA)', '(CN_X_HK)', '(HK)',
       '(IN)', '(JP)', '(MX)', '(NG)', '(NZ)', '(SG)', '(ZA)', '(KR)',
       '(TW)', '(US)'], dtype=object)

In [59]:
def clean_codes(column: str):
    clean_text = re.sub('[^a-zA-Z \n\.]', '', column)
    return clean_text

In [78]:
table = table[table['Country'].notna()]
table

          Country CountryCode
0         Belgium        (BE)
1        Bulgaria        (BG)
2         Czechia        (CZ)
3         Denmark        (DK)
4         Germany        (DE)
..            ...         ...
70      Singapore        (SG)
71   South Africa        (ZA)
72    South Korea        (KR)
73         Taiwan        (TW)
74  United States        (US)

[72 rows x 2 columns]

In [79]:
table['CountryCode'] = table.apply(lambda x: clean_codes(x['CountryCode']), axis=1)

In [82]:
table['CountryCode'].unique()

array(['BE', 'BG', 'CZ', 'DK', 'DE', 'EE', 'IE', 'EL', 'ES', 'FR', 'HR',
       'IT', 'CY', 'LV', 'LT', 'LU', 'HU', 'MT', 'NL', 'AT', 'PL', 'PT',
       'RO', 'SI', 'SK', 'FI', 'SE', 'IS', 'LI', 'NO', 'CH', 'UK', 'ME',
       'MK', 'AL', 'RS', 'TR', 'BA', 'XK', 'AM', 'AZ', 'BY', 'MD', 'GE',
       'UA', 'DZ', 'EG', 'IL', 'JO', 'LB', 'LY', 'MA', 'PS', 'SY', 'TN',
       'RU', 'AR', 'AU', 'BR', 'CA', 'CNXHK', 'HK', 'IN', 'JP', 'MX',
       'NG', 'NZ', 'SG', 'ZA', 'KR', 'TW', 'US'], dtype=object)